Repository: gibex/RoadRo_iOS
Catalog: RoadRo/*.lproj/Localizable.strings
Languages: ro

source: Address
ro: Adresă

source: Attach at least one picture
ro: Trimite cel puțin o fotografie

source: Back
ro: Înapoi

source: Choose a photo
ro: Alege o fotografie

source: Community
ro: Comunitate

source: Continue
ro: Continuă

source: Finalized
ro: Finalizată

source: History
ro: Istoric

source: In process
ro: În lucru

source: Loading...
ro: Se încarcă...

source: New report
ro: Sesizare nouă

source: Pending
ro: Neprocesată

source: Pictures from location
ro: Fotografii de la locație

source: Please provide your phone number for the account creation
ro: Completează numărul de telefon pentru crearea unui cont

source: Provide event location
ro: Completează locația evenimentului

source: Register
ro: Înregistrare

source: Remarks
ro: Observații

source: Report
ro: Sesizare

source: Send report
ro: Trimite sesizarea

source: Take picture
ro: Fotografiază

source: Thank you! Your report has been sent.
ro: Mulțumim! Sesizarea ta a fost trimisă.

source: To send us a report, please submit below information
ro: Pentru a ne trimite o sesizare, te rugăm să ne transmiți câteva informații

source: Welcome! This application will help you send reports for illegal parking activity you notice.
ro: Bine ai venit! Această aplicație te va ajuta să ne trimiți sesizări pentru parcările ilegale pe care le observi.

source: You haven't added any repport
ro: Nu ai adaugat nicio sesizare
